# Компьютер запрашивает у пользователя число N
# и создает таблицу (списки вложенные в список)
# размером N строк на N столбцов, заполненную
# следующим образом:
#     при N <= 0
#         пустой список
# 
#     при N = 1
#         [
#           [1]
#         ]
# 
#     при N = 2
#         [
#           [1, 0],
#           [0, 1]
#         ]
# 
#     при N = 3
#         [
#           [1, 0, 0],
#           [0, 1, 0],
#           [0, 0, 1],
#         ]
# 
#     при N = 4
#         [
#           [1, 0, 0, 0],
#           [0, 1, 0, 0],
#           [0, 0, 1, 0],
#           [0, 0, 0, 1],
#         ]
# 
#    и так далее
# 
#    За list comprehension  +1 коин


